---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.#ctor
source: html/2c910840-a1d4-1ef3-ed95-50c3778c71e8.htm
---
# Autodesk.Revit.DB.ExportFontTable.#ctor Method

Constructs a new ExportFontTable with default values.

## Syntax (C#)
```csharp
public ExportFontTable()
```